backend/controllers/PostController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
UPDATE `post` SET `judul`='Mendapatkan Pelajaran Mengenai Pertemanan dari Fairy Tail', `updated_at`=1425206860, `status`=1, `alias`=0 WHERE `id`=9