frontend/controllers/BlogController.php

    public function actionIndex()
    {
		Url::remember();
		$ap = Yii::$app->urlManager->createUrl(['site/page', 'id' => 'about']);
		$query = Post::find()
				->where(['status'=>1])
				->orderby('created_at DESC');
		$count = clone $query;
		$pages = new Pagination(['totalCount' => $count->count(), 'pageSize'=>6]);
		$post  = $query->offset($pages->offset)
					->limit($pages->limit)
					->all();
---
SELECT COUNT(*) FROM `post` WHERE `status`=1 ORDER BY `created_at` DESC
SELECT * FROM `post` WHERE `status`=1 ORDER BY `created_at` DESC LIMIT 6