frontend/controllers/SiteController.php

SELECT * FROM `post` WHERE `status`=1 ORDER BY `id` DESC LIMIT 3
---
    public function actionIndex()
    {
		Url::remember();
		$quote = \common\models\quote::find()
				->all();
		$post = \common\models\Post::find()
				->where(['status'=>1])
				->orderby('id DESC')
				->limit(3)
				->all();

SELECT * FROM `user` WHERE `status_legal`=1 ORDER BY `status_user` DESC
---
    public function actionAbout()
    {
		Url::remember();
		$member = \common\models\User::find()
				->where(['status_legal'=>1])
				->orderby('status_user DESC')
				->all();