backend/views/post/_form.php


					echo '<option value="1" '.$sAdmin.' >Admin</option>';
					echo '<option value="0" '.$sUser.'>';
						$user = User::find()->where(['id'=>$model->user_id])->one();
---
SELECT * FROM `user` WHERE `id`='14250470322110131041'