backend/views/post/view.php

SELECT * FROM `user` WHERE `id`='14250470322110131041'
---
		Author &emsp;&emsp; :
		<?php
			$user_id = $model->user_id;
			$user = User::find()->where(['id'=>$user_id])->one();