common/models/User.php

SELECT * FROM `user` WHERE (`id`='14250470322110131041') AND (`status_legal`=1)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status_legal' => self::STATUS_ACTIVE]);