frontend/views/blog/index.php

SELECT * FROM `user` WHERE `id`='14250470322110131041'
---
						<div class="by">by
						<?php
							if($post->alias==0){
								$user = User::find()->where(['id'=>$post->user_id])->one();