frontend/views/member/register.php

				<?= $form->field($model, 'nama') ?>
				<?= $form->field($model, 'nrp') ?>
				<label>Departemen</label><br>
				<?= Html::activeDropDownList($model, 'departemen',
					ArrayHelper::map(Departemen::find()->all(), 'id', 'nama'), ['class'=>'form-control']) ?>
---
SELECT * FROM `departemen`